# IsFontItalic Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableCellStyle..::..IsFontItalic Property
TableCellStyle Class See Also
---
Gets or sets whether the text font is set to italic of this cell.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsFontItalic { get; set; }
```

Visual Basic
---
```text
Public Property IsFontItalic As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsFontItalic {
	bool get ();
	void set (bool value);
}
```

# ### Field Value
true if the font is italic; otherwise false.
# See Also
TableCellStyle Class
Autodesk.Revit.DB Namespace